       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLOWORLD.

       PROCEDURE DIVISION.
           DISPLAY "Hello, World! from COBOL!".
           STOP RUN.
           