       IDENTIFICATION DIVISION.
       PROGRAM-ID. RUN-TESTS.

       PROCEDURE DIVISION.
           DISPLAY "Starting the Calculator Test Program".
           
           CALL 'CALCULATOR-TEST'.

           DISPLAY "Finished the Calculator Test Program".
           STOP RUN.
       